# 패턴 dict
pattern_dict = {1: r'[\🎶\●\-\=\+,\#\/\?\:\^\.\@\*\"\※\~\ㆍ\!\』\‘\|\(\)\[\]\`\'\…\》\”\’\·\{\}\u200b\u200d\U0001f90d\xa0\ufeff\u0602]',
                2: r'[a-zA-Z]',
                3: r'[0-9]',
                4: r'[一-龥]'
                }
# 일본어 정규식 r'[[ぁ-ゔ]+|[ァ-ヴー]+[々〆〤]]'

pos_dict = {
    'mecab' : {
        '1' : ['NNG','NNP', 'VV+EC', 'VV+EP'],
        '2': ['VA'],
        '3' : ['VV']

    },
    'okt' : {
        '1' : ['Noun'],
        '2' : ['Adjective'],
        '3' : ['Verb']
    }
}

stopwords = ['그래,아니,아,뭐,응,네,예,자,야,글쎄,참,어디,그럼,아아,얘,임마,아이고,'
             '여보,어,저,원,아이구,음,글쎄요,아냐,어머,오,흥,아이,에이,허허,아니야,'
             '여보세요,그러나,그리고,그런데,그래서,따라서,하지만,또,또는,그러므로,및,'
             '또한,그러면,즉,그럼,그러니까,그렇지만,오히려,역시,그리하여,다만,혹은,'
             '그래도,한편,이른바,더구나,왜냐하면,근데,그러자,더욱이,하긴,하기야,'
             '그러면서,하물며,그러니,그러다가,단,이리하여,그,이,한,두,다른,그런,이런,'
             '어떤,모든,어느,몇,여러,무슨,세,전,저,각,첫,새,아무,약,네,아무런,총,제,'
             '온,옛,오랜,단,올,온갖,별,현,한두,맨,양,몇몇,수,딴,서너,저런,두어,모,주,'
             '석,스무,여느,이런저런,본,동,웬,헌,순,왠,요,두세,지난,근,타,그까짓,매,고,'
             '갖은,것,수,등,년,때문,일,중,월,씨,데,번,명,원,개,거,가지,뿐,듯,간,쪽,분,'
             '시,채,만,대,년대,줄,놈,적,터,만큼,바,측,내,편,차,자,세,대로,점,달러,살,초,'
             '식,외,셈,듯이,지,회,장,호,개월,말,따위,리,마리,위,녀석,평,무렵,나름,마련,권,'
             '척,양,법,이,바람,쯤,건,판,지경,도,달,군,조,주일,뻔,시간,부,이래,등등,주,개국,'
             '푼,군데,체,거리,년도,따름,주년,격,등지,통,겸,설,참,둥,퍼센트,남짓,미터,기,나위,'
             '즈음,마당,바퀴,여지,치,벌,그루,박,투,승,김,가량,큰술,엔,모금,발짝,석,겨를,전,개소,'
             '동,톤,개년,한,짝,킬로미터,집,세기,섬,냥,턱,되,나,그,우리,이,그것,그녀,내,자기,무엇,'
             '이것,누구,저,여기,어디,너,뭐,당신,거기,이곳,그곳,제,아무,네,자네,언제,여러분,이거,너희,'
             '니,저희,아무개,이놈,그놈,저기,그분,그대,그거,모,저쪽,뭣,저것,그이,이쪽,그쪽,지,얘,걔,저편,'
             '저놈,네놈,그네,아니,이']
# 하나로 합치는 방법
# list(itertools.chain.from_iterable(pos_dict['mecab'].values()))
